Revit 2027 API
ExporterIFCUtils.GetElevationProfile Method
 Obtains the curve loops which bound the wall's elevation profile.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<CurveLoop> GetElevationProfile(
	Wall pVWall
)
Public Shared Function GetElevationProfile (
	pVWall As Wall
) As IList(Of CurveLoop)
public:
static IList<CurveLoop^>^ GetElevationProfile(
	Wall^ pVWall
)
static member GetElevationProfile :
        pVWall : Wall -> IList<CurveLoop>
Parameters
pVWall Wall
 The wall.
Return Value
IList<CurveLoop>
 The collection of curve loops.
Exceptions
Exception | Condition
ArgumentException |  The wall does not have an elevation profile.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace